import random

answer = ["Бесспорно", "Предрешено", "Никаких сомнений", "Определённо да", "Можешь быть уверен в этом",
          "Мне кажется - да", "Вероятнее всего", "Хорошие перспективы", "Знаки говорят - да", "Да",
          "Пока неясно, попробуй снова", "Спроси позже", "Лучше не рассказывать", "Сейчас нельзя предсказать",
          "Сконцентрируйся и спроси опять", "Даже не думай", "Мой ответ - нет", "По моим данным - нет",
          "Перспективы не очень хорошие", "Весьма сомнительно"]

print('Привет Мир, я магический шар, и я знаю ответ на любой твой вопрос.')
print('Напишите Ваше имя:')
name = input()
print('Привет,', name)

while True:
    print('Задайте свой вопрос:')
    question = input()
    print(random.choice(answer))
    print('Хотите задать еще вопрос?')
    user_answer = input()
    if user_answer not in ['хочу', 'да', 'lf', '[jxe']:
        print('Возвращайся если возникнут вопросы!')
        break
